# global settings
encoding = "utf_8_sig"

products = [
    "パソコン",
    "電気ストーブ",
    "自転車",
    "カラーテレビ",
    "照明器具",
    "電気温風機",
    "電気衣類乾燥機",
    "冷蔵庫",
    "扇風機",
    "ノートパソコン",
    "掃除機",
    "ヘアドライヤー",
    "電気洗濯機",
    "電気こんろ",
    "電気スタンド",
    "スチームアイロン",
    "電気オーブントースター",
    "電気オーブンレンジ",
    "電気やかん",
    "加湿器",
    "電気玩具",
    "電子レンジ",
    "エアコン",
    "電気ファンヒーター",
    "電気床暖房機",
    "電動工具",
    "電気ジャー炊飯器",
    "電気ポット",
    "電磁調理器",
    "電気たこ焼き器",
    "ミキサー",
    "電気文具",
    "ホットプレート",
    "ふとん乾燥機",
]

# process.py
cols = ["事故原因区分", "被害の種類", "品名", "品目"]

# mecab_analysis.py
word_class = ["名詞", "形容詞", "動詞"]

danger_states = [
    "溶融",
    "発煙",
    "焼損",
    "異音",
    "異臭",
    "破損",
    "発火",
    "火花",
    "破裂",
    "煙",
    "焦げ臭い",
    "出火",
    "破片",
    "火",
    "変色",
    "変形",
    "熱",
    "破裂音",
    "飛散",
    "炎",
    "点滅",
    "発熱",
    "充満",
    "感電",
    "損傷",
    "溶解",
    "汚損",
    "切断",
    "発光",
    "破断",
]

danger_actions = []

injures = ["傷", "裂傷", "軽傷", "火傷", "痛く"]
